clc;clear;close all

a1=[2.374460633230597,3.680013787916771,6.373179336072664,11.756116695295864];
a2=[2.416580543913035,4.462673946250819,8.912149199164345,16.828558889790280];


y1=log(a1);
y2=log(a2);
x=[1 2 3 4];
p1=polyfit(x,y1,1);
p2=polyfit(x,y2,1);
taoH1_1=p1(1)./log(2);
taoH1_2=p2(1)./log(2);



figure;plot(a1,'r*');
hold on
plot(a2,'r*');
plot(2.^(x*taoH1_1)*exp(p1(2)))
plot(2.^(x*taoH1_2)*exp(p2(2)))



b1=[12.577965112805245,29.690439918427277,88.812919883964260,3.049976173432103e+02];
b2=[13.854232470081172,39.843112434489100,1.557439924353431e+02,5.737587228528884e+02];

pb1=polyfit(x,log(b1),1);
pb2=polyfit(x,log(b2),1);
taoH2_1=pb1(1)./log(2);
taoH2_2=pb2(1)./log(2);
figure;plot(b1,'r*');
hold on
plot(b2,'r*');
plot(2.^(x*taoH2_1)*exp(pb1(2))) %把对数换成指数形式
plot(2.^(x*taoH2_2)*exp(pb2(2))) %把对数换成指数形式
hold off
